[
  {
    "ingredients": "\nFor the Rice:\n\n2 cups Basmati rice, washed and soaked for 30 minutes\n4 cups water\n1-2 bay leaves\n4-5 whole cloves\n4-5 whole green cardamom pods\n1 cinnamon stick\nSalt to taste\n\nFor the Chicken:\n1 kg chicken, cut into pieces\n1 cup plain yogurt\n1 tablespoon ginger-garlic paste\n1 teaspoon turmeric powder\n1 teaspoon red chili powder\nSalt to taste\n\nFor the Biryani:\n3 large onions, thinly sliced\n1 cup cooking oil or ghee\n1 cup chopped tomatoes\n1/2 cup fresh coriander leaves, chopped\n1/2 cup fresh mint leaves, chopped\n1 tablespoon biryani masala (available at Indian grocery stores)\nSaffron strands soaked in warm milk (optional)\nFried onions for garnish (optional)",
    "itemName": "Biryani",
    "imageUrl": "https://plus.unsplash.com/premium_photo-1694141252026-3df1de888a21?q=80&w=1469&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "itemDescription": "\nPreparing the Rice:\nIn a large pot, bring 4 cups of water to a boil.\nAdd the soaked and drained Basmati rice, bay leaves, cloves, cardamom pods, cinnamon stick, and salt.\nCook the rice until it is 70-80% cooked. The grains should still be firm. Drain the water and set aside.\n\nMarinating the Chicken:\nIn a bowl, mix the chicken pieces with yogurt, ginger-garlic paste, turmeric powder, red chili powder, and salt.\nAllow the chicken to marinate for at least 30 minutes or longer for better flavor.\n\nCooking the Chicken:\nIn a large, heavy-bottomed pan, heat oil or ghee over medium heat.\nAdd the sliced onions and sauté until golden brown. Remove half of the fried onions for garnishing.\nAdd the marinated chicken to the pan and cook until it is browned and the oil separates.\nAdd chopped tomatoes, biryani masala, fresh coriander leaves, and mint leaves. Cook until the tomatoes are soft and the chicken is cooked through.\n\nLayering and Dum Cooking:\nIn a heavy-bottomed pan or a biryani pot, layer half of the partially cooked rice at the bottom.\nSpread the cooked chicken mixture evenly over the rice layer.\nTop with the remaining rice, spreading it evenly.\nDrizzle saffron-soaked milk (optional) over the rice. You can also add a few drops of food coloring to the milk for a vibrant look.\nSprinkle the reserved fried onions over the top.\nCover the pot tightly with a lid or foil. Cook on low heat (dum) for about 20-25 minutes. This allows the flavors to meld, and the rice cooks completely.\n\nServe:\nGently fluff the biryani with a fork.\nServe hot, garnished with additional fresh coriander leaves and mint leaves.\nEnjoy the biryani with raita or a side salad."
  },
  {
    "ingredients": "\nFor Chana Masala (Chickpea Curry):\n1 cup dried chickpeas (soaked overnight and boiled until tender)\n2 tablespoons oil\n1 large onion, finely chopped\n2 tomatoes, chopped\n1 teaspoon ginger-garlic paste\n1 teaspoon cumin seeds\n1 teaspoon coriander powder\n1/2 teaspoon turmeric powder\n1/2 teaspoon red chili powder\n1/2 teaspoon garam masala\nSalt to taste\n\nFresh coriander leaves for garnish\nFor Halwa (Semolina Pudding):\n1 cup semolina (suji or sooji)\n1/2 cup ghee (clarified butter)\n1 cup sugar\n2 cups water\n1/2 teaspoon cardamom powder\nA handful of chopped nuts (almonds, cashews, pistachios) for garnish\n\nFor Puri (Deep-Fried Bread):\n2 cups whole wheat flour\nWater for kneading\nOil for deep frying",
    "itemName": "Halwa Puri",
    "imageUrl": "https://images.unsplash.com/photo-1605719161691-5d9771fc144f?q=80&w=1442&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "itemDescription": "\nFor Chana Masala:\nHeat oil in a pan. Add cumin seeds and let them splutter.\nAdd chopped onions and sauté until golden brown.\nAdd ginger-garlic paste and sauté until the raw smell disappears.\nAdd chopped tomatoes and cook until they become soft.\nAdd coriander powder, turmeric powder, red chili powder, garam masala, and salt. Cook the spices for a couple of minutes.\nAdd boiled chickpeas and mix well. Let it simmer for 10-15 minutes until the flavors meld.\nGarnish with fresh coriander leaves and keep it warm.\n\nFor Halwa:\nHeat ghee in a pan. Add semolina and roast it on low-medium heat until it turns golden brown and releases a nutty aroma.\nIn a separate saucepan, heat water and sugar until the sugar dissolves. Add this sugar water to the roasted semolina slowly, stirring continuously to avoid lumps.\nCook the mixture until it thickens. Add cardamom powder and chopped nuts. Mix well.\nContinue cooking until the halwa reaches your desired consistency. It should be smooth and not too dry.\nKeep the halwa warm.\n\nFor Puri:\nMix whole wheat flour with water to make a soft, pliable dough.\nDivide the dough into small balls and roll them into flat circles.\nHeat oil in a deep pan for frying.\nFry the puris until they puff up and turn golden brown.\nRemove excess oil by placing the puris on paper towels.\n\nAssembling Halwa Puri:\nServe Chana Masala, Halwa, and Puri on a plate.\nEnjoy Halwa Puri by tearing a piece of Puri, spooning some Chana Masala onto it, and finishing with a bite of Halwa."
  },
  {
    "ingredients": "\nFor the Rice:\n2 cups basmati rice, soaked for 30 minutes and drained\n4 cups water\n2 tablespoons oil\n1-2 cinnamon sticks\n4-5 whole cloves\n4-5 whole green cardamom pods\nSalt to taste\n\nFor the Meat:\n1 kg lamb or chicken, cut into pieces\n2 tablespoons vegetable oil\n1 large onion, finely chopped\n2 teaspoons ginger-garlic paste\n1 teaspoon ground coriander\n1 teaspoon ground cumin\n1 teaspoon turmeric powder\nSalt and pepper to taste\n\nFor Garnish:\n1 cup sliced carrots\n1/2 cup raisins (optional)\n1/2 cup slivered almonds or chopped pistachios\nChopped fresh cilantro or mint for garnish",
    "itemName": "Kabuli Pulao",
    "imageUrl": "https://images.unsplash.com/photo-1626266798999-aa2b0c520cc9?q=80&w=1374&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "itemDescription": "\nPreparing the Rice:\nIn a large pot, bring 4 cups of water to a boil.\nAdd soaked and drained basmati rice to the boiling water along with oil, cinnamon sticks, cloves, green cardamom pods, and salt.\nCook the rice until it's about 70-80% cooked. The grains should still be firm. Drain the water and set aside.\n\nCooking the Meat:\nIn a separate pot, heat vegetable oil over medium heat.\nAdd chopped onions and sauté until golden brown.\nAdd ginger-garlic paste and sauté until the raw smell disappears.\nAdd the meat pieces and cook until they are browned on all sides.\nAdd ground coriander, ground cumin, turmeric powder, salt, and pepper. Mix well to coat the meat with the spices.\nPour in enough water to cover the meat. Cover and simmer until the meat is tender and cooked through.\n\nLayering and Dum Cooking:\nIn the pot with the cooked meat, spread half of the partially cooked rice evenly.\nSprinkle sliced carrots, raisins (if using), and slivered almonds or chopped pistachios over the rice layer.\nTop with the remaining rice, spreading it evenly.\nCover the pot tightly with a lid or foil. Cook on low heat (dum) for about 20-25 minutes. This allows the flavors to meld, and the rice cooks completely.\n\nServing:\nGently fluff the rice with a fork, mixing in the meat and garnishes.\nServe the Kabuli Pulao on a platter, garnished with chopped fresh cilantro or mint."
  },
  {
    "ingredients": "\nFor the Nihari Spice Mix (Nihari Masala):\n2 tablespoons coriander seeds\n1 tablespoon fennel seeds\n1 tablespoon cumin seeds\n1 tablespoon whole black peppercorns\n1 tablespoon whole cloves\n1 tablespoon green cardamom pods\n2-3 black cardamom pods\n1 cinnamon stick (about 2 inches)\n1 teaspoon turmeric powder\n1 teaspoon ground nutmeg\n\nFor the Nihari:\n1 kg beef stew meat or beef shanks\n3 tablespoons ghee or oil\n2 large onions, thinly sliced\n2 tablespoons ginger-garlic paste\n2 tablespoons Nihari Masala (from above)\n1 teaspoon red chili powder (adjust to taste)\n1/2 teaspoon ground cinnamon\n1/2 teaspoon ground cloves\nSalt to taste\n8 cups water\n2 tablespoons wheat flour (optional, for thickening)\n\nFor Garnish:\nFresh coriander leaves, chopped\nGinger slices\nGreen chilies, sliced\nLemon wedges",
    "itemName": "Nihari",
    "imageUrl": "https://media.istockphoto.com/id/1577140507/photo/indian-pakistani-desi-food-nihari-with-naan.jpg?s=1024x1024&w=is&k=20&c=_7JFOHQtdPrlPxNZmfB5MioyeM12OB6k6c5tTLs23Zo=",
    "itemDescription": "\n1. Prepare Nihari Masala:\nDry roast coriander seeds, fennel seeds, cumin seeds, black peppercorns, cloves, green cardamom pods, black cardamom pods, and cinnamon stick until fragrant. Grind the roasted spices along with turmeric powder and nutmeg to form a fine powder. This is your Nihari Masala.\n\n2. Brown the Meat:\nIn a large, heavy-bottomed pot, heat ghee or oil over medium heat. Add sliced onions and sauté until golden brown.\nAdd ginger-garlic paste and sauté for a minute until the raw smell disappears.\nAdd beef stew meat or beef shanks and brown the meat on all sides.\n\n3. Add Spices and Nihari Masala:\nAdd Nihari Masala, red chili powder, ground cinnamon, ground cloves, and salt to the browned meat. Mix well to coat the meat with the spices.\n\n4. Slow Cook the Nihari:\nPour in water and bring the mixture to a boil.\nOnce boiling, reduce the heat to low, cover the pot, and let it simmer for at least 4-6 hours. The longer the simmering, the richer the flavors.\n\n5. Optional Thickening:\nIf you prefer a thicker consistency, mix wheat flour with a little water to form a smooth paste. Add this paste to the simmering pot and stir well. Cook for an additional 30 minutes.\n\n6. Garnish and Serve:\nOnce the meat is tender and the broth is rich, garnish the Nihari with chopped coriander leaves, ginger slices, and green chilies.\nServe hot with naan or steamed rice. Offer lemon wedges on the side for squeezing over the Nihari."
  },
  {
    "ingredients": "\n4 to 6 pieces of cow or goat trotters (cleaned and split)\n1 cup wheat grains (soaked overnight)\n2 large onions (finely sliced)\n4 tomatoes (chopped)\n1/2 cup yogurt\n1/2 cup cooking oil or ghee (clarified butter)\n1 tablespoon ginger paste\n1 tablespoon garlic paste\n1 tablespoon cumin powder\n1 tablespoon coriander powder\n1 teaspoon turmeric powder\n1 teaspoon red chili powder (adjust to taste)\nSalt to taste\n\nFresh coriander leaves (for garnish)\nFresh ginger slices (for garnish)\nGaram masala (whole spices) for baghar/tempering (optional)",
    "itemName": "Paye",
    "imageUrl": "https://images.unsplash.com/photo-1523986490752-c28064f26be3?q=80&w=1469&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "itemDescription": "\nClean and Soak the Trotters:\nClean the trotters thoroughly and soak them in water for a few hours or overnight to remove any excess blood.\n\nBoil Trotters and Wheat:\nIn a large pot, add the trotters and soaked wheat grains.\nAdd enough water to cover the trotters and wheat.\nBring it to a boil, then reduce the heat to low and simmer until the trotters and wheat are tender. This may take several hours, and you can use a pressure cooker to expedite the process.\n\nPrepare the Masala:\nIn a separate pan, heat oil or ghee over medium heat.\nAdd sliced onions and sauté until golden brown.\nAdd ginger paste and garlic paste, and cook until the raw smell disappears.\nAdd chopped tomatoes and cook until they are soft and the oil starts to separate.\nAdd yogurt, cumin powder, coriander powder, turmeric powder, red chili powder, and salt. Cook the masala until the oil separates from the spices.\n\nCombine Trotters, Wheat, and Masala:\nOnce the trotters and wheat are tender, add the prepared masala to the pot.\nMix everything well and let it simmer on low heat for at least another 30 minutes, allowing the flavors to meld.\n\nPrepare Baghar (Optional):\nIn a small pan, heat a few tablespoons of oil or ghee.\nAdd garam masala (whole spices) and let them sizzle for a few seconds.\nPour this baghar over the simmering Siri Paye for added flavor.\n\nServe:\nGarnish the Siri Paye with fresh coriander leaves and ginger slices.\nServe hot with naan or crusty bread."

  },
  {
    "ingredients": "\nFor the stuffing:\n1 cup long-grain rice\n1/2 cup pine nuts\n1/2 cup currants or raisins\n1/4 cup olive oil\n1 large onion, finely chopped\n2 cloves garlic, minced\n1/4 cup chopped fresh dill\n1/4 cup chopped fresh mint\nSalt and pepper to taste\n\nFor the grape leaves:\n1 jar of grape leaves in brine (about 60-70 leaves)\nWater, for rinsing grape leaves\n\nFor cooking:\n1 lemon, juiced\n1/4 cup olive oil\n2 cups vegetable broth or water",
    "itemName": "Greece Dolma",
    "imageUrl": "https://images.unsplash.com/photo-1636141186543-476c0defe0f0?q=80&w=1473&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "itemDescription": "\nPrepare the Grape Leaves:\nIf using jarred grape leaves, rinse them thoroughly under cold running water to remove excess salt.\nGently separate the leaves and trim any tough stems.\n\nPrepare the Filling:\nIn a skillet, heat 1/4 cup of olive oil over medium heat.\nAdd chopped onions and garlic, sauté until translucent.\nAdd pine nuts and sauté until they are lightly golden.\nStir in the rice and cook for 2-3 minutes until the rice is coated with oil.\nAdd currants or raisins, chopped dill, chopped mint, salt, and pepper. Stir well and cook for another 2-3 minutes.\nRemove the mixture from heat and let it cool.\n\nAssemble the Dolma:\nPlace a grape leaf shiny side down on a flat surface.\nAdd a small amount of the rice mixture (about a tablespoon) to the center of the leaf.\nFold the sides of the leaf over the filling and then roll it tightly from the bottom to the top, creating a cigar-like shape.\n\nCook the Dolma:\nArrange the dolma in a large pot, placing them close together to prevent them from unraveling during cooking.\nMix the lemon juice and 1/4 cup of olive oil and pour it over the dolma.\nPour vegetable broth or water over the dolma until they are just covered.\nPlace a heavy plate or an upside-down bowl on top of the dolma to keep them in place while cooking.\nBring to a boil, then reduce the heat to low, cover, and simmer for about 45-60 minutes, or until the rice is cooked and the grape leaves are tender.\n\nServe:\nOnce cooked, let the dolma cool before serving.\nServe with a side of tzatziki sauce or yogurt, and garnish with lemon wedges if desired."
  },
  {
    "ingredients": "\nFor the Napa Cabbage:\n1 large napa cabbage\n1 cup coarse sea salt\n\nFor the Kimchi Paste:\n1 medium-sized Korean radish (or daikon radish), julienned\n5-6 green onions, chopped\n1 cup Korean red pepper flakes (gochugaru)\n1/2 cup fish sauce\n1/3 cup soy sauce\n1/4 cup sugar\n1 tablespoon minced garlic\n1 tablespoon minced ginger\n1 teaspoon salted shrimp paste (saeujeot) - optional but traditional\n1 teaspoon sugar (for brining the radish)",
    "itemName": "Kimchi Korea",
    "imageUrl": "https://plus.unsplash.com/premium_photo-1700161713164-411ac86b0455?q=80&w=1470&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "itemDescription": "\nPrepare the Napa Cabbage:\nCut the napa cabbage in half lengthwise and then into quarters.\nDissolve 1 cup of coarse sea salt in a large bowl of water.\nSubmerge the cabbage quarters in the saltwater, making sure the saltwater gets between the leaves.\nLet the cabbage soak for 1-2 hours, turning occasionally.\n\nRinse and Drain:\nRinse the cabbage thoroughly under cold running water to remove excess salt.\nGently squeeze out any excess water and let it drain.\n\nPrepare the Kimchi Paste:\nJulienne the Korean radish and mix it with 1 teaspoon of sugar. Let it sit for about 15 minutes, then drain any released liquid.\nIn a large bowl, combine the julienned radish, chopped green onions, Korean red pepper flakes, fish sauce, soy sauce, sugar, minced garlic, minced ginger, and salted shrimp paste (if using). Mix well to form a paste.\n\nCombine Cabbage and Paste:\nSpread the kimchi paste between the cabbage leaves, making sure to coat each layer.\n\nPack into Jars:\nPack the kimchi into clean glass jars, pressing it down to remove air pockets.\nLeave some space at the top of the jars to allow for expansion during fermentation.\n\nFermentation:\nSeal the jars and let them sit at room temperature for about 1-5 days, depending on your desired level of fermentation.\nBurp the jars daily to release gases produced during fermentation.\nOnce it reaches the desired taste, refrigerate the kimchi to slow down the fermentation process.\n\nServe:\nKimchi can be served as a side dish, in rice bowls, or used in various Korean recipes."
  },
  {
    "ingredients": "\nFor the Falafel:\n1 cup dried chickpeas (soaked overnight and drained)\n1 small onion, roughly chopped\n3 cloves garlic\n1/2 cup fresh parsley, chopped\n1 teaspoon ground cumin\n1 teaspoon ground coriander\n1/2 teaspoon cayenne pepper (adjust to taste)\nSalt and pepper to taste\n1 teaspoon baking powder\n3-4 tablespoons all-purpose flour or chickpea flour (as needed)\nVegetable oil for frying\n\nFor Serving:\nPita bread or flatbreads\nTahini sauce or yogurt sauce\nChopped tomatoes, cucumbers, and lettuce",
    "itemName": "Turkish Falafel",
    "imageUrl": "https://images.unsplash.com/photo-1593001874117-c99c800e3eb8?q=80&w=1470&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
    "itemDescription": "\nPrepare Chickpeas:\nSoak dried chickpeas in water overnight. Drain well before using.\n\nMake Falafel Mixture:\nIn a food processor, combine soaked and drained chickpeas, chopped onion, garlic, fresh parsley, cumin, coriander, cayenne pepper, salt, and pepper.\nPulse the mixture until everything is finely ground, but not pureed. You may need to scrape down the sides of the processor bowl to ensure an even mix.\n\nAdd Baking Powder and Flour:\nAdd baking powder and start by adding 3 tablespoons of flour. Pulse to combine.\nCheck the consistency of the mixture. It should be able to hold together when you squeeze it. If it's too wet, add more flour, one tablespoon at a time, until the mixture is easy to shape.\n\nShape Falafel:\nScoop out small portions of the mixture and shape them into small patties or balls. You can use your hands or a falafel scoop.\n\nFry the Falafel:\nHeat vegetable oil in a deep pan to around 350°F (175°C).\nCarefully place the falafel into the hot oil, frying until they are golden brown and crispy on the outside. This usually takes about 3-4 minutes per batch.\nUse a slotted spoon to remove the falafel from the oil and place them on a paper towel-lined plate to absorb excess oil.\n\nServe:\nServe the Turkish falafel in pita bread or flatbreads.\nAdd chopped tomatoes, cucumbers, and lettuce.\nDrizzle with tahini sauce or yogurt sauce."
  }
]
